saf_payload.xml

<?xml version="1.0" encoding="utf-8" ?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Header>
		<ns1:NotifySOAPHeader xmlns:ns1="http://www.huawei.com.cn/schema/common/v2_1">
			<ns1:spId>601727</ns1:spId>
			<ns1:serviceId>6017272000120157</ns1:serviceId>
			<ns1:linkid>31191220075803041123</ns1:linkid>
			<ns1:traceUniqueID>404090102571603311612208716004</ns1:traceUniqueID>
		</ns1:NotifySOAPHeader>
	</soapenv:Header>
	<soapenv:Body>
		<ns2:notifySmsReception
			xmlns:ns2="http://www.csapi.org/schema/parlayx/sms/notification/v2_2/local">
			<ns2:correlator>1232</ns2:correlator>
			<ns2:message>
				<message>CITAM</message>
				<senderAddress>tel:720988636</senderAddress>
				<smsServiceActivationNumber>tel:40235</smsServiceActivationNumber>
				<dateTime>2016-03-31T16:12:20Z</dateTime>
			</ns2:message>
		</ns2:notifySmsReception>
	</soapenv:Body>
</soapenv:Envelope>
